src/InformationRegisters/ПравилаСвойствСообщений/ПравилаСвойствСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаСвойствСообщений</name>
  <resources>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>GUID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПравилаСвойствСообщений/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Запись.GUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		Запись.GUID = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)                                                                      
	ОписаниеОповещения = Новый ОписаниеОповещения("УсловияПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ПравилаСвойствСообщений.Форма.ФормаНастройкиУсловий", Новый Структура("Условия", Запись.Условия), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура УсловияПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента("condition");
	Для Каждого Элемент Из Результат Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("case");
		ЗаписьXML.ЗаписатьАтрибут("condition", Элемент.ТипСравнения);
		ЗаписьXML.ЗаписатьАтрибут("property", Элемент.ИмяСвойства);
		ЗаписьXML.ЗаписатьАтрибут("type", Элемент.ТипСвойства);
		ЗаписьXML.ЗаписатьАтрибут("value", Элемент.Значение);		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Запись.Условия = ЗаписьXML.Закрыть();
КонецПроцедуры
